meeting/agenda/2024/05-14.org
:PROPERTIES:
:ID:       A5673773-28E0-456A-ACDC-ADEDC21CAA6C
:END:
#+title: QT4 CG Meeting 077 Agenda 2024-05-14
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2024/05-07.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 14 May. The following meeting is scheduled for
21 May.

** Review of open action items [1/7]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record
+ [ ] QT4CG-071-06: NW to clarify the cases that are distinguished by the leading empty string in path segments
+ [ ] QT4CG-072-03: NW to clarify the round-tripping of URIs
+ [ ] QT4CG-073-01: NW to proceed with the records/options proposal and make a PR.
+ [ ] QT4CG-075-01: MK to drop the deterministic option and raise it as a separate issue.
+ [ ] QT4CG-075-02: MK to define sequence-concatenation more formally with links where appropriate
+ [ ] QT4CG-076-01: MK to draft an editorial proposal to add more examples.

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-956][#956]]: 850-partial Editorial improvements to parse-html()
+ PR [[https://qt4cg.org/dashboard/#pr-832][#832]]: 77 Add map:deep-update and array:deep-update
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528 fn:elements-to-maps

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1200][#1200]]: QT4CG-075-02 Define the term sequence concatenation
+ PR [[https://qt4cg.org/dashboard/#pr-1190][#1190]]: 1188 XQFO hash

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/572][#572]]: fn:evaluate-xpath() function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/369][#369]]: Namespaces for Functions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/162][#162]]: Support unbounded variadic functions on map parameter keys
+ Issue [[https://github.com/qt4cg/qtspecs/issues/146][#146]]: fn:apply with last two arguments (array, map) for the positional and keyword args in a func-call

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focused
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-1181][#1181]]: 296 Allow default-namespace=##any
+ PR [[https://qt4cg.org/dashboard/#pr-1015][#1015]]: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes
+ PR [[https://qt4cg.org/dashboard/#pr-921][#921]]: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch
+ PR [[https://qt4cg.org/dashboard/#pr-871][#871]]: Action qt4 cg 027 01 next match

These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/168][#168]]: XSLT Extension Instructions invoking Named Templates

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1206][#1206]]: 1195 Hash Function: CRC-32
+ PR [[https://qt4cg.org/dashboard/#pr-1205][#1205]]: 1196 Math Functions: math:e, math:sinh, math:cosh, math:tanh
+ PR [[https://qt4cg.org/dashboard/#pr-1204][#1204]]: 1203 Define out-of-range conditions in CSV get function
+ PR [[https://qt4cg.org/dashboard/#pr-1198][#1198]]: 1189 distinct document order
+ PR [[https://qt4cg.org/dashboard/#pr-1197][#1197]]: 1192 Allow fn as abbreviation for function
+ PR [[https://qt4cg.org/dashboard/#pr-1191][#1191]]: 1167, 934 deep equal merge collations param
+ PR [[https://qt4cg.org/dashboard/#pr-1185][#1185]]: 1179 array:values, map:values → contents
+ PR [[https://qt4cg.org/dashboard/#pr-1117][#1117]]: 1116 Add options param to unparsed-text
+ PR [[https://qt4cg.org/dashboard/#pr-1108][#1108]]: 566-partial Describe a less aggressive %-encoding for fn:build-uri
+ PR [[https://qt4cg.org/dashboard/#pr-1098][#1098]]: 566-partial Editorial improvements for parse-uri
+ PR [[https://qt4cg.org/dashboard/#pr-1068][#1068]]: 73 fn:graphemes
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis - revised proposal for fn:ranks
+ PR [[https://qt4cg.org/dashboard/#pr-1027][#1027]]: 150 fn:ranks

*** Proposed for V4.0
:PROPERTIES:
:CUSTOM_ID: proposed-40
:END:

The following issues are labled “proposed for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1069][#1069]]: fn:ucd
+ Issue [[https://github.com/qt4cg/qtspecs/issues/982][#982]]: Add position argument to scan-left and scan-right
+ Issue [[https://github.com/qt4cg/qtspecs/issues/938][#938]]: Canonical serialization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/934][#934]]: String comparison in deep-equal
+ Issue [[https://github.com/qt4cg/qtspecs/issues/910][#910]]: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"
+ Issue [[https://github.com/qt4cg/qtspecs/issues/908][#908]]: Function identity: documentation, nondeterminism
+ Issue [[https://github.com/qt4cg/qtspecs/issues/882][#882]]: fn:chain or fn:compose
+ Issue [[https://github.com/qt4cg/qtspecs/issues/850][#850]]: fn:parse-html: Finalization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]]: Generators in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep, drop, replace with $err:stack-trace ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/657][#657]]: User-defined functions in main modules without `local` prefix
+ Issue [[https://github.com/qt4cg/qtspecs/issues/557][#557]]: fn:unparsed-binary: accessing and manipulating binary types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/150][#150]]: fn:ranks: Produce all ranks in applying a function on the items of a sequence
+ Issue [[https://github.com/qt4cg/qtspecs/issues/31][#31]]: Extend FLWOR expressions to maps


* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #1206: 1195 Hash Function: CRC-32
:PROPERTIES:
:CUSTOM_ID: h-DAF5929A-7ACB-42BC-9897-7D1284FCAACE
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1206][#1206]].

** PR #1205: 1196 Math Functions: math:e, math:sinh, math:cosh, math:tanh
:PROPERTIES:
:CUSTOM_ID: h-09E91844-EA79-4154-919F-619AF5ECE138
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1205][#1205]].

** PR #1204: 1203 Define out-of-range conditions in CSV get function
:PROPERTIES:
:CUSTOM_ID: h-50D3BF36-C162-43B8-B0D1-0522E6CBA8E1
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1204][#1204]].

** PR #1198: 1189 distinct document order
:PROPERTIES:
:CUSTOM_ID: h-9CC122BD-1CBE-43B2-B53E-3948F05FE1C6
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1198][#1198]].

** PR #1197: 1192 Allow fn as abbreviation for function
:PROPERTIES:
:CUSTOM_ID: h-FC21A285-E29C-474D-99A8-021A81CAE65F
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1197][#1197]].

** PR #1191: 1167, 934 deep equal merge collations param
:PROPERTIES:
:CUSTOM_ID: h-08A874BB-C635-4661-AE68-192D905F7D9F
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1191][#1191]].

** PR #1185: 1179 array:values, map:values → contents
:PROPERTIES:
:CUSTOM_ID: pr-1185
:END:
See [[https://qt4cg.org/dashboard/#pr-1185][PR #1185]].

** PR #1117: 1116 Add options param to unparsed-text
:PROPERTIES:
:CUSTOM_ID: pr-1117
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1117][#1117]]

** PR #1068: 73 fn:graphemes
:PROPERTIES:
:CUSTOM_ID: pr-1068
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1068][#1068]]

** PR #1062/#1027: fn:ranks
:PROPERTIES:
:CUSTOM_ID: pr-1062
:END:

See PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]
See PR [[https://qt4cg.org/dashboard/#pr-1027][#1027]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
