meeting/agenda/2024/05-14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 077 Agenda 2024-05-14</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 077 Agenda 2024-05-14</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/05-07.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 14 May. The following meeting is scheduled for
21 May.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/7]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-071-06: NW to clarify the cases that are distinguished by the leading empty string in path segments</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-072-03: NW to clarify the round-tripping of URIs</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-073-01: NW to proceed with the records/options proposal and make a PR.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-075-01: MK to drop the deterministic option and raise it as a separate issue.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-075-02: MK to define sequence-concatenation more formally with links where appropriate</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-076-01: MK to draft an editorial proposal to add more examples.</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-956">#956</a>: 850-partial Editorial improvements to parse-html()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>: 77 Add map:deep-update and array:deep-update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528 fn:elements-to-maps</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1200">#1200</a>: QT4CG-075-02 Define the term sequence concatenation</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1190">#1190</a>: 1188 XQFO hash</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/572">#572</a>: fn:evaluate-xpath() function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/369">#369</a>: Namespaces for Functions</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/162">#162</a>: Support unbounded variadic functions on map parameter keys</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/146">#146</a>: fn:apply with last two arguments (array, map) for the positional and keyword args in a func-call</li>
</ul>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.4.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focused
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1181">#1181</a>: 296 Allow default-namespace=##any</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1015">#1015</a>: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-921">#921</a>: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-871">#871</a>: Action qt4 cg 027 01 next match</li>
</ul>

<p>
These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/168">#168</a>: XSLT Extension Instructions invoking Named Templates</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.5.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1206">#1206</a>: 1195 Hash Function: CRC-32</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1205">#1205</a>: 1196 Math Functions: math:e, math:sinh, math:cosh, math:tanh</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1204">#1204</a>: 1203 Define out-of-range conditions in CSV get function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1198">#1198</a>: 1189 distinct document order</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1197">#1197</a>: 1192 Allow fn as abbreviation for function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1191">#1191</a>: 1167, 934 deep equal merge collations param</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1185">#1185</a>: 1179 array:values, map:values → contents</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1117">#1117</a>: 1116 Add options param to unparsed-text</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1108">#1108</a>: 566-partial Describe a less aggressive %-encoding for fn:build-uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1098">#1098</a>: 566-partial Editorial improvements for parse-uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1068">#1068</a>: 73 fn:graphemes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis - revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1027">#1027</a>: 150 fn:ranks</li>
</ul>
</div>
</div>

<div id="outline-container-proposed-40" class="outline-4">
<h4 id="proposed-40"><span class="section-number-4">1.6.6.</span> Proposed for V4.0</h4>
<div class="outline-text-4" id="text-proposed-40">
<p>
The following issues are labled “proposed for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1069">#1069</a>: fn:ucd</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/982">#982</a>: Add position argument to scan-left and scan-right</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/938">#938</a>: Canonical serialization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/934">#934</a>: String comparison in deep-equal</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/910">#910</a>: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/908">#908</a>: Function identity: documentation, nondeterminism</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/882">#882</a>: fn:chain or fn:compose</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/850">#850</a>: fn:parse-html: Finalization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/716">#716</a>: Generators in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep, drop, replace with $err:stack-trace ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/657">#657</a>: User-defined functions in main modules without `local` prefix</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/557">#557</a>: fn:unparsed-binary: accessing and manipulating binary types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/150">#150</a>: fn:ranks: Produce all ranks in applying a function on the items of a sequence</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/31">#31</a>: Extend FLWOR expressions to maps</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-h-DAF5929A-7ACB-42BC-9897-7D1284FCAACE" class="outline-3">
<h3 id="h-DAF5929A-7ACB-42BC-9897-7D1284FCAACE"><span class="section-number-3">2.1.</span> PR #1206: 1195 Hash Function: CRC-32</h3>
<div class="outline-text-3" id="text-h-DAF5929A-7ACB-42BC-9897-7D1284FCAACE">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1206">#1206</a>.
</p>
</div>
</div>

<div id="outline-container-h-09E91844-EA79-4154-919F-619AF5ECE138" class="outline-3">
<h3 id="h-09E91844-EA79-4154-919F-619AF5ECE138"><span class="section-number-3">2.2.</span> PR #1205: 1196 Math Functions: math:e, math:sinh, math:cosh, math:tanh</h3>
<div class="outline-text-3" id="text-h-09E91844-EA79-4154-919F-619AF5ECE138">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1205">#1205</a>.
</p>
</div>
</div>

<div id="outline-container-h-50D3BF36-C162-43B8-B0D1-0522E6CBA8E1" class="outline-3">
<h3 id="h-50D3BF36-C162-43B8-B0D1-0522E6CBA8E1"><span class="section-number-3">2.3.</span> PR #1204: 1203 Define out-of-range conditions in CSV get function</h3>
<div class="outline-text-3" id="text-h-50D3BF36-C162-43B8-B0D1-0522E6CBA8E1">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1204">#1204</a>.
</p>
</div>
</div>

<div id="outline-container-h-9CC122BD-1CBE-43B2-B53E-3948F05FE1C6" class="outline-3">
<h3 id="h-9CC122BD-1CBE-43B2-B53E-3948F05FE1C6"><span class="section-number-3">2.4.</span> PR #1198: 1189 distinct document order</h3>
<div class="outline-text-3" id="text-h-9CC122BD-1CBE-43B2-B53E-3948F05FE1C6">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1198">#1198</a>.
</p>
</div>
</div>

<div id="outline-container-h-FC21A285-E29C-474D-99A8-021A81CAE65F" class="outline-3">
<h3 id="h-FC21A285-E29C-474D-99A8-021A81CAE65F"><span class="section-number-3">2.5.</span> PR #1197: 1192 Allow fn as abbreviation for function</h3>
<div class="outline-text-3" id="text-h-FC21A285-E29C-474D-99A8-021A81CAE65F">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1197">#1197</a>.
</p>
</div>
</div>

<div id="outline-container-h-08A874BB-C635-4661-AE68-192D905F7D9F" class="outline-3">
<h3 id="h-08A874BB-C635-4661-AE68-192D905F7D9F"><span class="section-number-3">2.6.</span> PR #1191: 1167, 934 deep equal merge collations param</h3>
<div class="outline-text-3" id="text-h-08A874BB-C635-4661-AE68-192D905F7D9F">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1191">#1191</a>.
</p>
</div>
</div>

<div id="outline-container-pr-1185" class="outline-3">
<h3 id="pr-1185"><span class="section-number-3">2.7.</span> PR #1185: 1179 array:values, map:values → contents</h3>
<div class="outline-text-3" id="text-pr-1185">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-1185">PR #1185</a>.
</p>
</div>
</div>

<div id="outline-container-pr-1117" class="outline-3">
<h3 id="pr-1117"><span class="section-number-3">2.8.</span> PR #1117: 1116 Add options param to unparsed-text</h3>
<div class="outline-text-3" id="text-pr-1117">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1117">#1117</a>
</p>
</div>
</div>

<div id="outline-container-pr-1068" class="outline-3">
<h3 id="pr-1068"><span class="section-number-3">2.9.</span> PR #1068: 73 fn:graphemes</h3>
<div class="outline-text-3" id="text-pr-1068">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1068">#1068</a>
</p>
</div>
</div>

<div id="outline-container-pr-1062" class="outline-3">
<h3 id="pr-1062"><span class="section-number-3">2.10.</span> PR #1062/#1027: fn:ranks</h3>
<div class="outline-text-3" id="text-pr-1062">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>
See PR <a href="https://qt4cg.org/dashboard/#pr-1027">#1027</a>
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
